ahnafnafee.postscript-preview
alefragnani.read-only-indicator
bbenoist.doxygen
cpmcgrath.codealignment-vscode
cschlosser.doxdocgen
dan-c-underwood.arm
dbaeumer.vscode-eslint
dioxuslabs.dioxus
eamodio.gitlens
editorconfig.editorconfig
esbenp.prettier-vscode
eserozvataf.one-dark-pro-monokai-darker
fabiospampinato.vscode-diff
felixangelov.mason
fill-labs.dependi
fortran-lang.linter-gfortran
foxundermoon.shell-format
george-alisson.html-preview-vscode
github.copilot-chat
github.vscode-github-actions
grapecity.gc-excelviewer
gruntfuggly.todo-tree
james-yu.latex-workshop
kevinkassimo.cargo-toml-snippets
ltex-plus.vscode-ltex-plus
mechatroner.rainbow-csv
mesonbuild.mesonbuild
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-dotnettools.csdevkit
ms-dotnettools.csharp
ms-dotnettools.vscode-dotnet-runtime
ms-python.autopep8
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.cmake-tools
ms-vscode.cpp-devtools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.hexeditor
ms-vscode.live-server
ms-vscode.makefile-tools
ms-vscode.remote-explorer
ms-vscode.remote-server
ms-vscode.vscode-serial-monitor
ms-vsliveshare.vsliveshare
mshr-h.veriloghdl
myriad-dreamin.tinymist
njpwerner.autodocstring
oderwat.indent-rainbow
phplasma.csv-to-table
plorefice.devicetree
redhat.vscode-yaml
repreng.csv
rioj7.commandonallfiles
rust-lang.rust-analyzer
searking.preview-vscode
shakram02.bash-beautify
svelte.svelte-vscode
tamasfe.even-better-toml
tcwalther.cython
theoolee.reader-mode
theqtcompany.qt-core
trond-snekvik.gnu-mapfiles
twxs.cmake
wakatime.vscode-wakatime
wayou.vscode-todo-highlight
xaver.clang-format
yzhang.markdown-all-in-one